{
    "about": "Hi, it's Robin. I am a german software engineer and freelance developer from Berlin/Germany. First of all, thank you for reading my blog. It's such a pleasure to have you here!\nA couple of words about my professional life: I am a German software and web developer dedicated to learning and teaching JavaScript. After obtaining my Master's Degree in computer science, I gained experience from the startup world where I used JavaScript intensively during both my professional life and spare time. For a few years, I worked closely with an exceptional team of engineers at a company in Berlin, developing large-scale JavaScript applications, which eventually led to a desire to teach others about these topics.",
    "values_and_mission": "I try my best to have a positive impact on the world. 99% of my code is open source for everyone on GitHub. Every time I build a product/service for myself, I immediately think about how to open source it for others. Even though I open source my work and offer lots of learning material for free, not everyone is able to make use of it. Many people have no access to it because they didn't had the chance to learn the English language in the first place. That's why I try here and there to volunteer or to donate money to good causes. I have the strong believe that the major issue of diversity in our industry is due to inaccessible education for people outside of the western world. Apart from the language barrier, most educational content is too expensive. Whereas a programming course for $99 might be affordable in the US, it's out of reach for any eager programmer in South East Asia. I know that many programmers producing educational courses need to make a living, I am sitting in one boat with them, but there are options to make educational content affordable for others around the world too. After all, I hope that I can give something back by believing in these values and my mission to make education more accessible to everyone."
}