{
    "banner": {
        "title": "Robin Wieruch",
        "sub_title": "German Software Engineer for React.js, Node.js and GraphQL"
    },
    "about_me": {
        "title": "About Me",
        "caption": "Get to know me before you dive into my content.",
        "description": "I am a self-employed software and web engineer dedicated to learning and teaching JavaScript for client-server architectures. After obtaining my Master's Degree in computer science, I gained experience from the startup world, where I used JavaScript intensively during both my professional life and spare time. Eventually it led me to teach others about these topics and to offer online courses and on-site consulting for companies. I am happy to welcome you on my website :-)"
    },
    "what_i_offer": {
        "caption": "Why you might want to hire me.",
        "items": [
            {
                "id": 1,
                "title": "Workshops",
                "description": "Teaching your team on-site/remote to get them up to speed with the latest web technologies for client-server applications in JavaScript."
            },
            {
                "id": 2,
                "title": "Code Audit",
                "description": "Conducting code reviews for your JavaScript application together with your team or a single person which usually last 2-3 days."
            },
            {
                "id": 3,
                "title": "MVP",
                "description": "Bringing your idea to code from zero to one as a minimal viable product (MVP) and beyond within a well-architected application."
            },
            {
                "id": 4,
                "title": "Complex Problems",
                "description": "Solving complex problems in JavaScript code which you want to have eliminated in your application's code base but no one dares to fix."
            },
            {
                "id": 5,
                "title": "Writing Code",
                "description": "Coding along with your team on a large scale application to make your customers happy with new features and performance improvements."
            },
            {
                "id": 6,
                "title": "Technical Writing",
                "description": "Writing tutorials about your technical product, open source work, or API (all related to JavaScript) to get more publicity for it."
            }
        ]
    },
    "Portfolio": {
        "caption": "What you can learn from me.",
        "items": [
            {
                "id": 1,
                "title": "Online Courses"
            },
            {
                "id": 2,
                "title": "Open Source"
            },
            {
                "id": 3,
                "title": "Tutorials"
            }
        ]
    },
    "vita": {
        "caption": "My professional story.",
        "items": [
            {
                "id": 1,
                "title": "Master of Science",
                "year": "2009 - 2014",
                "description": "I graduated with a master of science in computer science. Lots of this knowledge can be applied for more complex problems in client-server architectures."
            },
            {
                "id": 2,
                "title": "Freelancer",
                "year": "2010 - 2014",
                "description": "While studing computer science, I got my hands dirty by writing JavaScript, Java, and C# applications for several clients in Germany."
            },
            {
                "id": 3,
                "title": "Startups",
                "year": "2014 - 2017",
                "description": "I worked closely with an exceptional team of engineers at a company in Berlin developing large scale applications for thousands of customers."
            },
            {
                "id": 4,
                "title": "React Book",
                "year": "2016",
                "description": "This year I published my first book about React.js. Within the first month it had more than 10.000 readers and today it is one of the most popular React.js books."
            },
            {
                "id": 4,
                "title": "Redux Book",
                "year": "2017",
                "description": "I published my second book about state management with Redux in React.js which I took one level further by packaging it as a full-blown online course."
            },
            {
                "id": 5,
                "title": "GraphQL Book",
                "year": "2018",
                "description": "As an early adopter of GraphQL in my recent jobs, I wrote my third book about it for modern client-server applications using GraphQL in JavaScript."
            },
            {
                "id": 6,
                "title": "Developer Magazines",
                "year": "2018",
                "description": "Every other month I write for a German software developer magazine educational content about JavaScript and its ecosystem."
            },
            {
                "id": 7,
                "title": "Firebase Book",
                "year": "2018",
                "description": "Later this year, I published my fourth book/course about Firebase in React to build modern frontend applications without worrying about your backend application."
            },
            {
                "id": 8,
                "title": "Self-Employed",
                "year": "2017 - TODAY",
                "description": "Lots of demand for JavaScript on-site or remote training, implementations for MVPs, code reviews, or complex JavaScript problem solving, led me to being self-employed."
            }
        ]
    },
    "testimonials": {
        "caption": "What industry leaders are saying",
        "items": [
            {
                "id": 1,
                "title": "Shawn Wang",
                "post": "Developer Experience at Netlify",
                "description": "Robin is one of the most consistently high quality React educators. His approach directly addresses practical concerns you *will* face in your daily React work, without talking down to you or wasting your time with fluff. Don’t just take my word for it - look at his public work and you’ll see"
            },
            {
                "id": 2,
                "title": "Tania Rascia",
                "post": "JS Dev, Online Educator",
                "description": "Robin is an excellent teacher. His articles and tutorials are in-depth and informative, and his code is clear and concise. I've found an answer on his site countless times when researching a problem, and I know that's one less article I have to write."
            },
            {
                "id": 3,
                "title": "Kent C. Dodds",
                "post": "Full-time JavaScript Instructor",
                "description": "Everything that I've read from Robin has been top tier quality stuff. There are blog posts that I have wanted to write, but then I found one by Robin and decided I didn't need to. Fantastic content"
            },
            {
                "id": 4,
                "title": "Christian Nwamba",
                "post": "JS Dev, Organizer of Concatenate",
                "description": "You can tell how much time Robin has put into a teaching piece when you consume his content. I have partnered with Robin and he sets the bar high for other teachers and content creators – this results to a quality learning ecosystem for his students regardless if a content or course was thought by him or not."
            },
            {
                "id": 5,
                "title": "Dan Abramov",
                "post": "React.js Core Team",
                "description": "I haven't read this book yet, but the previous educational materials made by Robin were nothing short of amazing. Thanks for creating this content and putting it out there!"
            },
            {
                "id": 6,
                "title": "Preethi Kasireddy",
                "post": "Founder & CEO of TruStory",
                "description": "If it's anything to do with React and it's written by Robin, you can trust that it'll be world-class. His books are some of the best content you'll find on the web for learning React."
            },
            {
                "id": 7,
                "title": "Kamran Ahmed",
                "post": "Founder & CEO of roadmap.sh",
                "description": "I have known Robin through his content for 5+ years; I have read his books and several of his blog posts. Robin is an excellent teacher and content creator. I can guarantee that you'll be hard pressed to find anyone knowing React and the ecosystem more than Robin."
            }
        ]
    }
}