{
    "react_developer": "Hello, my name is Robin Wieruch and I am a german/english speaking JavaScript enthusiast. In 2017 I quit my job at a Berlin tech startup. I made the decision to move on after being a software engineer for 2,5 years at this great company. It was a tough decision to make, because the company had a huge impact on me from a personal and professional perspective. It is always difficult to move on. But then again, I didn't want to get too comfortable.\n\nThe next natural step for me was being self-employed. Over the last years, I've put a lot of effort into my website and I started teaching thousands of people about full-stack software engineering and web development with JavaScript. I want to be bold and try to make this next step to have more time for the things that I truly value. I would separate these into four cornerstones: teaching, working, making, and volunteering.",
    "teaching": {
        "body": "The first cornerstone of my endeavour is teaching. Writing about my learnings in web development started as a sheer experiment. I enjoyed the process of writing, digging into the problems by trying to explain them to myself, and bringing the solutions on paper in concrete yet simple words. I never expected others to read about them. Yet, I grew an audience of over thousands of daily readers. Many people supported me in my doings and they gave me the opportunity to teach; an activity that I discovered as a meaningful thing to do in my life.\n\nYour opportunities to work with me:",
        "opportunities": [
            {
                "id": 1,
                "description": "Are you looking for workshops for your development team? Every month I offer workshops for companies who want to get their development department up and running in full-stack JavaScript. My workshops are mainly focused on React.js, Node.js and GraphQL, but here and there I teach a workshop about Webpack or other tech stacks as well. Usually a workshop takes up from 2 to 3 days and can be done on-site or remotely. The workshop will be highly engaging, meaning that it should be taken with smaller groups up to 5 people where everyone can share their screen while engaging in pair programming and discussions. I charge a fee per person per day. Interested in hearing more? Contact me."
            },
            {
                "id": 2,
                "description": "Are you looking for a place to advertise your open hiring positions? Your company name, a couple of words about your company, and a link to your open positions could show for every of my articles to attract potential candidates for your mission. This website has enough readers to make this an interesting opportunity for you and it already worked out well for other companies. Contact me to get more details about website impressions and how all of this would work out in detail."
            }
        ]
    }

}